/*
  ==============================
  データ定義（data.json を直接埋め込み）
  ==============================
*/

const data = [
{ "src": "10358_設定1相当_CZ間天井狙い_非リセット時_通常A_1_不問_駆け抜け_0~299_不問.png","設定":"設定1相当","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常A","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"駆け抜け","前回AT出玉":"0~299","殲滅ポイント":"不問" },
{ "src": "10360_設定混合_CZ間天井狙い_非リセット時_通常A_1_不問_駆け抜け_0~299_不問.png","設定":"設定混合","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常A","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"駆け抜け","前回AT出玉":"0~299","殲滅ポイント":"不問" },
{ "src": "10362_設定1相当_CZ間天井狙い_非リセット時_通常B_1_不問_駆け抜け_0~299_不問.png","設定":"設定1相当","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常B","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"駆け抜け","前回AT出玉":"0~299","殲滅ポイント":"不問" },
{ "src": "10364_設定混合_CZ間天井狙い_非リセット時_通常B_1_不問_駆け抜け_0~299_不問.png","設定":"設定混合","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常B","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"駆け抜け","前回AT出玉":"0~299","殲滅ポイント":"不問" },
{ "src": "10366_設定1相当_CZ間天井狙い_非リセット時_通常C_1_不問_駆け抜け_0~299_不問.png","設定":"設定1相当","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常C","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"駆け抜け","前回AT出玉":"0~299","殲滅ポイント":"不問" },
{ "src": "10368_設定混合_CZ間天井狙い_非リセット時_通常C_1_不問_駆け抜け_0~299_不問.png","設定":"設定混合","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常C","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"駆け抜け","前回AT出玉":"0~299","殲滅ポイント":"不問" },
{ "src": "10370_設定1相当_CZ間天井狙い_非リセット時_通常D_1_不問_駆け抜け_0~299_不問.png","設定":"設定1相当","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常D","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"駆け抜け","前回AT出玉":"0~299","殲滅ポイント":"不問" },
{ "src": "10372_設定混合_CZ間天井狙い_非リセット時_通常D_1_不問_駆け抜け_0~299_不問.png","設定":"設定混合","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常D","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"駆け抜け","前回AT出玉":"0~299","殲滅ポイント":"不問" },
{ "src": "10373_設定1相当_CZ間天井狙い_非リセット時_通常A_1_不問_2連以上_0~499_不問.png","設定":"設定1相当","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常A","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"2連以上","前回AT出玉":"0~499","殲滅ポイント":"不問" },
{ "src": "10374_設定1相当_CZ間天井狙い_非リセット時_通常A_1_不問_2連以上_500~999_不問.png","設定":"設定1相当","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常A","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"2連以上","前回AT出玉":"500~999","殲滅ポイント":"不問" },
{ "src": "10375_設定1相当_CZ間天井狙い_非リセット時_通常A_1_不問_2連以上_1000~1499_不問.png","設定":"設定1相当","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常A","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"2連以上","前回AT出玉":"1000~1499","殲滅ポイント":"不問" },
{ "src": "10376_設定混合_CZ間天井狙い_非リセット時_通常A_1_不問_2連以上_0~499_不問.png","設定":"設定混合","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常A","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"2連以上","前回AT出玉":"0~499","殲滅ポイント":"不問" },
{ "src": "10377_設定混合_CZ間天井狙い_非リセット時_通常A_1_不問_2連以上_500~999_不問.png","設定":"設定混合","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常A","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"2連以上","前回AT出玉":"500~999","殲滅ポイント":"不問" },
{ "src": "10378_設定混合_CZ間天井狙い_非リセット時_通常A_1_不問_2連以上_1000~1499_不問.png","設定":"設定混合","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常A","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"2連以上","前回AT出玉":"1000~1499","殲滅ポイント":"不問" },
{ "src": "10379_設定1相当_CZ間天井狙い_非リセット時_通常B_1_不問_2連以上_0~499_不問.png","設定":"設定1相当","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常B","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"2連以上","前回AT出玉":"0~499","殲滅ポイント":"不問" },
{ "src": "10380_設定1相当_CZ間天井狙い_非リセット時_通常B_1_不問_2連以上_500~999_不問.png","設定":"設定1相当","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常B","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"2連以上","前回AT出玉":"500~999","殲滅ポイント":"不問" },
{ "src": "10381_設定1相当_CZ間天井狙い_非リセット時_通常B_1_不問_2連以上_1000~1499_不問.png","設定":"設定1相当","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常B","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"2連以上","前回AT出玉":"1000~1499","殲滅ポイント":"不問" },
{ "src": "10382_設定混合_CZ間天井狙い_非リセット時_通常B_1_不問_2連以上_0~499_不問.png","設定":"設定混合","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常B","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"2連以上","前回AT出玉":"0~499","殲滅ポイント":"不問" },
{ "src": "10383_設定混合_CZ間天井狙い_非リセット時_通常B_1_不問_2連以上_500~999_不問.png","設定":"設定混合","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常B","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"2連以上","前回AT出玉":"500~999","殲滅ポイント":"不問" },
{ "src": "10384_設定混合_CZ間天井狙い_非リセット時_通常B_1_不問_2連以上_1000~1499_不問.png","設定":"設定混合","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常B","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"2連以上","前回AT出玉":"1000~1499","殲滅ポイント":"不問" },
{ "src": "10385_設定1相当_CZ間天井狙い_非リセット時_通常C_1_不問_2連以上_0~499_不問.png","設定":"設定1相当","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常C","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"2連以上","前回AT出玉":"0~499","殲滅ポイント":"不問" },
{ "src": "10386_設定1相当_CZ間天井狙い_非リセット時_通常C_1_不問_2連以上_500~999_不問.png","設定":"設定1相当","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常C","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"2連以上","前回AT出玉":"500~999","殲滅ポイント":"不問" },
{ "src": "10387_設定1相当_CZ間天井狙い_非リセット時_通常C_1_不問_2連以上_1000~1499_不問.png","設定":"設定1相当","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常C","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"2連以上","前回AT出玉":"1000~1499","殲滅ポイント":"不問" },
{ "src": "10388_設定混合_CZ間天井狙い_非リセット時_通常C_1_不問_2連以上_0~499_不問.png","設定":"設定混合","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常C","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"2連以上","前回AT出玉":"0~499","殲滅ポイント":"不問" },
{ "src": "10389_設定混合_CZ間天井狙い_非リセット時_通常C_1_不問_2連以上_500~999_不問.png","設定":"設定混合","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常C","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"2連以上","前回AT出玉":"500~999","殲滅ポイント":"不問" },
{ "src": "10390_設定混合_CZ間天井狙い_非リセット時_通常C_1_不問_2連以上_1000~1499_不問.png","設定":"設定混合","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常C","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"2連以上","前回AT出玉":"1000~1499","殲滅ポイント":"不問" },
{ "src": "10391_設定1相当_CZ間天井狙い_非リセット時_通常D_1_不問_2連以上_0~499_不問.png","設定":"設定1相当","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常D","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"2連以上","前回AT出玉":"0~499","殲滅ポイント":"不問" },
{ "src": "10392_設定1相当_CZ間天井狙い_非リセット時_通常D_1_不問_2連以上_500~999_不問.png","設定":"設定1相当","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常D","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"2連以上","前回AT出玉":"500~999","殲滅ポイント":"不問" },
{ "src": "10393_設定1相当_CZ間天井狙い_非リセット時_通常D_1_不問_2連以上_1000~1499_不問.png","設定":"設定1相当","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常D","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"2連以上","前回AT出玉":"1000~1499","殲滅ポイント":"不問" },
{ "src": "10394_設定混合_CZ間天井狙い_非リセット時_通常D_1_不問_2連以上_0~499_不問.png","設定":"設定混合","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常D","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"2連以上","前回AT出玉":"0~499","殲滅ポイント":"不問" },
{ "src": "10395_設定混合_CZ間天井狙い_非リセット時_通常D_1_不問_2連以上_500~999_不問.png","設定":"設定混合","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常D","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"2連以上","前回AT出玉":"500~999","殲滅ポイント":"不問" },
{ "src": "10396_設定混合_CZ間天井狙い_非リセット時_通常D_1_不問_2連以上_1000~1499_不問.png","設定":"設定混合","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常D","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"2連以上","前回AT出玉":"1000~1499","殲滅ポイント":"不問" },
{ "src": "10397_設定1相当_CZ間天井狙い_非リセット時_通常A_1_不問_不問_不問_不問.png","設定":"設定1相当","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常A","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"不問","前回AT出玉":"不問","殲滅ポイント":"不問" },
{ "src": "10398_設定混合_CZ間天井狙い_非リセット時_通常A_1_不問_不問_不問_不問.png","設定":"設定混合","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常A","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"不問","前回AT出玉":"不問","殲滅ポイント":"不問" },
{ "src": "10399_設定1相当_CZ間天井狙い_非リセット時_通常B_1_不問_不問_不問_不問.png","設定":"設定1相当","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常B","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"不問","前回AT出玉":"不問","殲滅ポイント":"不問" },
{ "src": "10400_設定混合_CZ間天井狙い_非リセット時_通常B_1_不問_不問_不問_不問.png","設定":"設定混合","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常B","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"不問","前回AT出玉":"不問","殲滅ポイント":"不問" },
{ "src": "10401_設定1相当_CZ間天井狙い_非リセット時_通常C_1_不問_不問_不問_不問.png","設定":"設定1相当","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常C","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"不問","前回AT出玉":"不問","殲滅ポイント":"不問" },
{ "src": "10402_設定混合_CZ間天井狙い_非リセット時_通常C_1_不問_不問_不問_不問.png","設定":"設定混合","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常C","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"不問","前回AT出玉":"不問","殲滅ポイント":"不問" },
{ "src": "10403_設定1相当_CZ間天井狙い_非リセット時_通常D_1_不問_不問_不問_不問.png","設定":"設定1相当","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常D","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"不問","前回AT出玉":"不問","殲滅ポイント":"不問" },
{ "src": "10404_設定混合_CZ間天井狙い_非リセット時_通常D_1_不問_不問_不問_不問.png","設定":"設定混合","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"通常D","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"不問","前回AT出玉":"不問","殲滅ポイント":"不問" },
{ "src": "10405_設定1相当_CZ間天井狙い_非リセット時_不問_1_不問_不問_不問_不問.png","設定":"設定1相当","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"不問","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"不問","前回AT出玉":"不問","殲滅ポイント":"不問" },
{ "src": "10406_設定混合_CZ間天井狙い_非リセット時_不問_1_不問_不問_不問_不問.png","設定":"設定混合","狙い目":"CZ間天井狙い","リセットの有無":"非リセット時","モード":"不問","CZスルー回数":"1","前回AT終了時差枚数":"不問","前回AT連数":"不問","前回AT出玉":"不問","殲滅ポイント":"不問" },







];

/*
  ==============================
  初期化
  ==============================
*/

const filtersDiv = document.getElementById("filters");
const galleryDiv = document.getElementById("gallery");

// src 以外を条件キーとして取得
const conditionKeys = Object.keys(data[0]).filter(key => key !== "src");

// select要素保持
const selects = {};

// 条件UI生成
conditionKeys.forEach(key => {
  const group = document.createElement("div");
  group.className = "filter-group";

  const label = document.createElement("label");
  label.textContent = key + "：";

  const select = document.createElement("select");

  // ユニーク値のみ追加（「すべて」は作らない）
  const values = [...new Set(data.map(item => item[key]))];

  values.forEach(value => {
    const option = document.createElement("option");
    option.value = value;
    option.textContent = value;
    select.appendChild(option);
  });

  select.addEventListener("change", update);

  group.appendChild(label);
  group.appendChild(select);
  filtersDiv.appendChild(group);

  selects[key] = select;
});

// 初期表示
update();

/*
  ==============================
  検索＆描画
  ==============================
*/

function update() {
  galleryDiv.innerHTML = "";

  const filtered = data.filter(item => {
    return conditionKeys.every(key => {
      return item[key] === selects[key].value;
    });
  });

  // 一致した画像のみ表示（0件なら何も表示しない）
  filtered.forEach(item => {
    const img = document.createElement("img");
    img.src = `images/${item.src}`;
    img.alt = item.src;
    galleryDiv.appendChild(img);
  });

}

